SantiniAmedeoVentiEdoardo/reactingFlows/initialConditions/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type            limitTemperature;
    active          yes;

    limitTemperatureCoeffs
    {
        selectionMode   all;
        min 250;
        max 1500;
    }
}

limitU
{
    type            limitVelocity;
    active          yes;

    limitVelocityCoeffs
    {
        selectionMode   all;
        max 500;
    }
}
